import { NewsItem } from '../types';

export const news: NewsItem[] = [
  {
    id: 6,
    date: "08.12.2025",
    content: "Обновлён перевод квестов сборки All The Mods 10 для версии 5.3.1"
  },
  {
    id: 5,
    date: "26.11.2025",
    content: "Обновлён перевод квестов сборки MC Eternal 2 для версии 1.2.0.2"
  },
  {
    id: 4,
    date: "15.11.2025",
    content: "Обновлён перевод квестов сборки SteamPunk [LPS] для версии v18."
  },
  {
    id: 3,
    date: "31.10.2025",
    content: "Добавлен перевод квестов новой сборки Society: Sunlit Valley, а также перевод множества модов!",
  },
  {
    id: 2,
    date: "30.10.2025",
    content: "Исправлено отображение основных изображений в квестах в сборке FTB Skies 2 для версии 1.9.2. ",
  },
  {
    id: 1,
    date: "27.10.2025",
    content: "Сайт запущен! Были добавлены существующие на данный момент переводы сборок, которые можно удобно скачать!",
  },
];
