import { NewsItem } from '../types';

export const news: NewsItem[] = [
  {
    id: 11,
    date: "02.04.2026",
    content: "Обновлён перевод квестов сборки FTB OceanBlock 2 для версии 1.16.0"
  },
  {
    id: 10,
    date: "27.03.2026",
    content: "Обновлён перевод квестов сборки Society: Sunlit Valley для версии 4.0.4"
  },
  {
    id: 9,
    date: "18.03.2026",
    content: "Добавлен перевод квестов новой сборки Create Chronicles: The Endventure, а также перевод множества модов!"
  },
  {
    id: 8,
    date: "07.01.2026",
    content: "Добавлен перевод квестов новой сборки Abyssal Ascent, а также перевод множества модов!"
  },
  {
    id: 7,
    date: "11.12.2025",
    content: "Обновлён перевод квестов сборки Society: Sunlit Valley для версии 3.4.3"
  },
  {
    id: 6,
    date: "08.12.2025",
    content: "Обновлён перевод квестов сборки All The Mods 10 для версии 5.3.1"
  },
  {
    id: 5,
    date: "26.11.2025",
    content: "Обновлён перевод квестов сборки MC Eternal 2 для версии 1.2.0.2"
  },
  {
    id: 4,
    date: "15.11.2025",
    content: "Обновлён перевод квестов сборки SteamPunk [LPS] для версии v18."
  },
  {
    id: 3,
    date: "31.10.2025",
    content: "Добавлен перевод квестов новой сборки Society: Sunlit Valley, а также перевод множества модов!",
  },
  {
    id: 2,
    date: "30.10.2025",
    content: "Исправлено отображение основных изображений в квестах в сборке FTB Skies 2 для версии 1.9.2. ",
  },
  {
    id: 1,
    date: "27.10.2025",
    content: "Сайт запущен! Были добавлены существующие на данный момент переводы сборок, которые можно удобно скачать!",
  },
];
